
namespace CoreService.Domain.Enums
{
    // это больше похоже на теги, наверное надо поменять потом!!!
    public enum Industry
    {
        РазработкаПО,                 
        ВебРазработка,               
        МобильнаяРазработка,        
        РазработкаИгр,               
        СистемноеПрограммирование,   
        РазработкаВстраиваемыхСистем,
        СистемноеАдминистрирование,  
        СетевыеТехнологии,           
        ОблачныеТехнологии,         
        ПоддержкаИТ,                
        Кибербезопасность,          
        Криптография,               
        БезопасностьСетей,           
        АнализДанных,               
        МашинноеОбучение,            
        ИскусственныйИнтеллект,     
        ХранениеДанных,             
        BigData,                     
        ТестированиеПО,             
        УправлениеПроектами,         
        БизнесАнализ,                
        UXUIDизайн,                  
        ПроектированиеИнтерфейсов,   
        Техподдержка,                
        ТехническаяДокументация,     
        ОбразованиеИТ,               
        ФрилансИТ,                   
        КонсалтингИТ,                
        Другое                       
    }

}
